<?php
/**
 * 範例
 * 1. class 名稱 須和檔名一樣
 * 2. 一個檔案 僅放一個class 以利維護
 * 3. 主程式 固定 置於 Main 方法 (唯一對外方法)
 * 4. 所有檔案 均需繼承 TIProtocol
 */
class Demo extends TIProtocol  {
	
	// ==========================================================================
	// 初始化 父層(TIProtocol) 的建構
	function __construct()
	{
		parent::__construct();
	}
	
	// ==========================================================================
	/**
	 * 主程序 :: 唯一對外方法
	 * @param json : $iData 
	 * * $iData : {
	 * 		"token"=>登入檢驗碼,
			"uid"=>使用者uid,
			"name"=>使用者暱稱,
	 * }
	 */ 
	public function Main($iData) 
	{
		// 
		echo 'TDemo';
	}
	
	// ============================================================
	// 私有方法...
	
	
}